Advanced_CFD_using_OpenFOAM/Geometries_using_snappyHexMesh/sphere_in_a_box/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//scale   1; // 0.1;

convertToMeters 1;

vertices
(
    (-5 -2 -2)
    (5 -2 -2)
    (5  2 -2)
    (-5 2 -2)
    (-5 -2 2)
    (5 -2 2)
    (5 2 2)
    (-5 2 2)              
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 8 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }

    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);











// ************************************************************************* //
