Advanced_CFD_using_OpenFOAM/Geometries_using_snappyHexMesh/sphere_in_a_box/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//surfaces ("sphere.stl");
sphere.stl
{
    // Extract raw features (none | extractFromFile | extractFromSurface)
    extractionMethod    extractFromSurface;

    // Mark edges whose adjacent surface normals are at an angle less
    // than includedAngle as features
    // - 0  : selects no edges
    // - 180: selects all edges
    includedAngle       150;

 /* curvature true;
    // Do not mark region edges
    geometricTestOnly   yes;

    // Generate additional intersection features (none | self | region)
    intersectionMethod  none;

    // Tolerance for surface intersections
    // tolerance           1e-3;
*/
subsetFeatures
{
    // Keep nonManifoldEdges (edges with >2 connected faces)
    nonManifoldEdges    no;

    // Keep open edges (edges with 1 connected face)
    openEdges           yes;
}
// Output options:

    // Write features to obj format for postprocessing
    writeObj            yes;
}




// ************************************************************************* //
